app/views/ports/_form.html.erb

      <%= f.label :switch_id %><br />
      <%= f.collection_select(:switch_id, Switch.all, :id,:name) %>
---
SELECT "switches".* FROM "switches"