app/views/ports/index.html.erb

    <td><%= port.interface %></td>
    <td><%= Switch.find(port.switch_id).name %></td>
---
SELECT "switches".* FROM "switches" WHERE "switches"."id" = ? LIMIT 1  [["id", 1]]