app/controllers/ports_controller.rb

SELECT "ports".* FROM "ports"
---
  def index
    @ports = Port.all

SELECT "ports".* FROM "ports" WHERE "ports"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @port = Port.find(params[:id])

INSERT INTO "ports" ("created_at", "interface", "status", "switch_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 02 Jan 2013 20:34:37 UTC +00:00], ["interface", "Fe0/22"], ["status", "UNASSIGNED"], ["switch_id", 1], ["updated_at", Wed, 02 Jan 2013 20:34:37 UTC +00:00]]
---
  def create
    @port = Port.new(params[:port])
    #this works just commented out for posterity
    @somevar=AssignPort("access", "2")

    respond_to do |format|
      if @port.save

SELECT "ports".* FROM "ports" WHERE "ports"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "ports" WHERE "ports"."id" = ?  [["id", 6]]
---
  def destroy
    @port = Port.find(params[:id])
    @port.destroy